---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx.FoldLength
source: html/b4dc519c-8d55-cc7b-19fe-47596c2cd247.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx.FoldLength Property

Fold segment length.

## Syntax (C#)
```csharp
public double FoldLength { get; set; }
```